function pow(x,n) // отсутствует пробел 
{ //скобка на отдельной строке
  let result=1; //нет пробелов
  for(let i=0;i<n;i++) {result*=x;} // нет пробелов, содержимое {} не перенесено
  return result;
}

let x=prompt("x?",''), n=prompt("n?",'') // нет пробелов, точек с запятой, не перенесено.
if (n<=0) //нет отступа, пробелов
{ //скобка на отдельной строке
  alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);
}
else // } else { выглядит лучше
{
  alert(pow(x,n))//нет пробелов, точки с запятой, вложенный вызов функции
}